This problem would be best suited for a Supervised learning approach because it is using data to predict an outcome

In [1]:
import numpy as np 
import pandas as pd 
import matplotlib.pyplot as plt 
import seaborn as sns

In [2]:
from matplotlib import rcParams 
rcParams['figure.figsize'] = 15, 5 
sns.set_style('darkgrid')
pd.options.display.float_format = "{:,.4f}".format

In [3]:
customers = pd.read_csv('data_h3_3337.csv') 
customers.head()

   CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

In [4]:
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   CustomerID              200 non-null    int64
 1   Gender                  200 non-null    object
 2   Age                     200 non-null    int64
 3   Annual Income (k$)      200 non-null    int64
 4   Spending Score (1-100)  200 non-null    int64
dtypes: int64(4), object(1)
memory usage: 7.9+ KB

In [5]:
customers.nunique()

CustomerID                200
Gender                      2
Age                        51
Annual Income (k$)         64
Spending Score (1-100)     84
dtype: int64

In [6]:
customers.describe()

       CustomerID      Age  Annual Income (k$)  Spending Score (1-100)
count    200.0000 200.0000            200.0000                200.0000
mean     100.5000  38.8500             60.5600                 50.2000
std       57.8792  13.9690             26.2647                 25.8235
min        1.0000  18.0000             15.0000                  1.0000
25%       50.7500  28.7500             41.5000                 34.7500
50%      100.5000  36.0000             61.5000                 50.0000
75%      150.2500  49.0000             78.0000                 73.0000
max      200.0000  70.0000            137.0000                 99.0000

There are 200 total entries in the data.<br>
There are no missing or null values.<br>
There are 200 unique customer IDs, 2 gender values, 51 age values, 64 income values, and 84 spending values.